replacements1 = {
    'Добровольное страхование прочего имущества юридических лиц': 'добровольное страхование имущества юридических лиц кроме транспортных средств грузов и сельскохозяйственного страхования',
    'Добровольное страхование прочего имущества граждан': 'добровольное страхование имущества граждан кроме транспортных средств грузов и сельскохозяйственного страхования'
}
replacements2 = {
    'прочего имущества': 'добровольное страхование имущества'
}
replacements3 = {
    'юридических лиц': 'юридических лиц кроме транспортных средств грузов и сельскохозяйственного страхования',
    'граждан': 'граждан кроме транспортных средств грузов и сельскохозяйственного страхования'
}
allowed_values_vertical = ['Всего', 'всего', 'вссего']
allowed_values_horizontal_agro = [
    'Добровольное сельскохозяйственное страхование, осуществляемое без государственной поддержки'
]
allowed_values_horizontal_life = [
    'Добровольное страхование жизни (кроме пенсионного страхования)',
    'Добровольное страхование жизни на случай смерти, дожития до определенного возраста или срока либо наступления иного события',
    'Добровольное страхование жизни с условием периодических страховых выплат (ренты, аннуитетов) и (или) с участием страхователя в инвестиционном доходе страховщика',
    'Добровольное пенсионное страхование',
    'Добровольное пенсионное страхование с единовременной уплатой страховой премии',
    'Добровольное страхование жизни на случай смерти, дожития до определенного возраста или срока либо наступления иного события с единовременной уплатой страховой премии',
    'Добровольное страхование жизни на случай смерти, дожития до определенного возраста или срока либо наступления иного события с уплатой страховой премии в рассрочку',
    'Добровольное страхование жизни с условием периодических страховых выплат (ренты, аннуитетов) и (или) с участием страхователя в инвестиционном доходе страховщика с единовременной уплатой страховой премии',
    'Добровольное страхование жизни с условием периодических страховых выплат (ренты, аннуитетов) и (или) с участием страхователя в инвестиционном доходе страховщика с уплатой страховой премии в рассрочку',
    'Инвестиционное страхование жизни',
    'Кредитное страхование жизни',
    'Накопительное страхование жизни',
    'Рисковое страхование жизни',
    'Прочее страхование жизни',
    'Добровольное пенсионное страхование с единовременной уплатой страховой премии',
    'Добровольное пенсионное страхование с уплатой страховой премии в рассрочку'
]